In [1]:
# enumerate
# pandas with dict wirh for loop
# Imp Examples

In [4]:
# enumerate
# min
# max
# print
# sum
# id
# len
# None

In [3]:
a = ['karan','ravi','mohan','akshay','anil']

for i in a:
    print(i)

karan
ravi
mohan
akshay
anil

In [5]:
a = ['karan','ravi','mohan','akshay','anil']

for i in enumerate(a):
    print(i)

(0, 'karan')
(1, 'ravi')
(2, 'mohan')
(3, 'akshay')
(4, 'anil')

In [ ]:
c,b = (0,'Mohan')

In [8]:
a = ['karan','ravi','mohan','akshay','anil']

for i,j in enumerate(a):
    print(i,j)

0 karan
1 ravi
2 mohan
3 akshay
4 anil

In [10]:
a = ['karan','ravi','mohan','akshay','anil']

for index,value in enumerate(a):
    print(value)

karan
ravi
mohan
akshay
anil

In [11]:
a = ['karan','ravi','mohan','akshay','anil']

for index,value in enumerate(a):
    if value == 'mohan':
        break
    print(value)

karan
ravi

In [12]:
a = ['karan','ravi','mohan','akshay','anil']

for index,value in enumerate(a):
    if index == 2:
        break
    print(value)

karan
ravi

In [14]:
a = ['karan','ravi','mohan','akshay','anil']

for index,value in enumerate(a):
    if index in [1,3,4]:
        continue
    print(value)

karan
mohan

In [17]:
next(enumerate(a))

(0, 'karan')

In [18]:
var = enumerate(a)

In [25]:
next(var)

StopIteration:

In [26]:
help('keywords')

Here is a list of the Python keywords.  Enter any keyword to get more help.

False               class               from                or
None                continue            global              pass
True                def                 if                  raise
and                 del                 import              return
as                  elif                in                  try
assert              else                is                  while
async               except              lambda              with
await               finally             nonlocal            yield
break               for                 not

In [27]:
# user input 
# name, age, class, address, sec
class = 57

SyntaxError: invalid syntax (2011969743.py, line 3)

In [28]:
for = 23

SyntaxError: invalid syntax (3556012459.py, line 1)

In [29]:
# user input 
# name, age, class, address, sec

In [30]:
name = input('Enter your name: ')
age = int(input('Enter your age: '))
Class = input('Enter your class: ')
address = input('Enter your address: ')
sec = input('Enter your sec: ')



data = {'Name':name,'Age':age,'Class':Class,'Address':address,'Sec':sec}

Enter your name: Karan
Enter your age: 23
Enter your class: 12
Enter your address: Noida
Enter your sec: A

C:\Users\Lenovo\anaconda3\Lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [31]:
data

{'Name': 'Karan', 'Age': 23, 'Class': '12', 'Address': 'Noida', 'Sec': 'A'}

In [32]:
import pandas as pd

In [33]:
pd.DataFrame(data,index=[0])

    Name  Age Class Address Sec
0  Karan   23    12   Noida   A

In [34]:
data = {'Name':[],'Age':[],'Class':[],'Address':[],'Sec':[]}

for i in range(1,6):
    name = input('Enter your name: ')
    age = int(input('Enter your age: '))
    Class = input('Enter your class: ')
    address = input('Enter your address: ')
    sec = input('Enter your sec: ')

    data['Name'].append(name)    
    data['Age'].append(age)
    data['Class'].append(Class)
    data['Address'].append(address)
    data['Sec'].append(sec)
    
    print(f'{i} Record Added Successfully!!')
    
pd.DataFrame(data)

Enter your name: Arun
Enter your age: 12
Enter your class: 10
Enter your address: Noida
Enter your sec: A
1 Record Added Successfully!!
Enter your name: Karan
Enter your age: 23
Enter your class: 12
Enter your address: Delhi
Enter your sec: B
2 Record Added Successfully!!
Enter your name: Jatin
Enter your age: 11
Enter your class: 7
Enter your address: Goa
Enter your sec: C
3 Record Added Successfully!!
Enter your name: Ravi
Enter your age: 16
Enter your class: 12
Enter your address: Noida
Enter your sec: B
4 Record Added Successfully!!
Enter your name: Rohan
Enter your age: 18
Enter your class: 11
Enter your address: Gr Noida
Enter your sec: A
5 Record Added Successfully!!

    Name  Age Class   Address Sec
0   Arun   12    10     Noida   A
1  Karan   23    12     Delhi   B
2  Jatin   11     7       Goa   C
3   Ravi   16    12     Noida   B
4  Rohan   18    11  Gr Noida   A

In [35]:
data

{'Name': ['Arun', 'Karan', 'Jatin', 'Ravi', 'Rohan'],
 'Age': [12, 23, 11, 16, 18],
 'Class': ['10', '12', '7', '12', '11'],
 'Address': ['Noida', 'Delhi', 'Goa', 'Noida', 'Gr Noida'],
 'Sec': ['A', 'B', 'C', 'B', 'A']}

In [37]:
table = pd.DataFrame(data)
table

    Name  Age Class   Address Sec
0   Arun   12    10     Noida   A
1  Karan   23    12     Delhi   B
2  Jatin   11     7       Goa   C
3   Ravi   16    12     Noida   B
4  Rohan   18    11  Gr Noida   A

In [38]:
table.to_excel(r"C:\Users\Lenovo\Desktop\student_details.xlsx")
print('Done')

Done

In [39]:
# H/w
# Employee 5
# Name, Emp_id, Designation, Dept, Salary, Address

# IMP Examples

# Sum of n natural numbers

In [45]:
# n = 10
# # 1+2+3+4+5+6+7+8+9+10 = 

n= 100
total_sum = 0
for i in range(1,n+1):
    total_sum+=i
    
print(total_sum)

5050

# factorial of a number

In [46]:
# 'ant'


# 'ant'
# 'atn'
# 'nat'
# 'tna'
# 'nta'
# 'tan'



# 'four'


# 'four'
# 'ourf'
# 'urfo'
# 'rfou'
# 'ruof'
# 'uofr'
# 'ofru'
# 'fruo'
# ..............

In [47]:
# 3!

3*2*1

6

In [48]:
4*3*2*1

24

In [49]:
5*4*3*2*1

120

In [50]:
10*9*8*7*6*5*4*3*2*1

3628800

In [53]:
n = 4

result = 1

for i in range(1,n+1):
    result*=i

print(result)

24

In [55]:
# max element
# min element

In [56]:
a = [1,23,212,43,4312,343,5,2,234,343,54,5]

max(a)

4312

In [64]:
a = [1,23,212,43,4312,343,5,2,234,34300,54,5]

my_max = a[0]

for i in a:
    if i>my_max:
        my_max = i
        
print(my_max)

34300

In [68]:
# min

import time
a = [100,23,212,43,4312,343,5,2,234,34300,54,5]

my_min = a[0]

for i in a:
    time.sleep(1)
    print(i,my_min)
    if i<my_min:
        my_min = i
        
print(my_min)

100 100
23 100
212 23
43 23
4312 23
343 23
5 23
2 5
234 2
34300 2
54 2
5 2
2

In [69]:
data = 'Basically, the sum of the first 100 natural numbers is equal to'

v_count = 0
c_count = 0


for i in data:
    if i.lower() in 'aeiou':
        v_count+=1
    else:
        c_count+=1
        
print('No of v:',v_count)
print('No of c:',c_count)

No of v: 18
No of c: 45

In [72]:
number  = 345

result = 0

for i in str(number):
    result+= int(i)
    
print(result)

12

In [73]:
# 3456787654